//该系统的功能于题目要求的一致
#include<stdlib.h>
#include<stdio.h>
#include<string.h>
#include<conio.h>//用于密码的输入，引用了getch()函数
#include<windows.h>//用于清空屏幕，程序休眠，引用system("cls")与Sleep函数
#include"student_score.h"
#include"for_information.h"
int main()//主函数主要载入界面，启动各类函数
{
	FILE *fp;
	int i,j=0,k=0;
	char password[17];
	if((fp=fopen("E:\\student_information.bin","rb"))==NULL)
	{
		make_student_inf();
	}
	printf("*************************************************************************\n");
	printf("**************************学分信息管理***********************************\n");
	printf("                                                       ——11823020220王游\n");
	printf("           1.管理员系统    2.学生系统     3.退出系统\n");
	printf("请进入正确的系统：");
	scanf("%d",&i);
	getchar();
	while(i!=3)
	{
		if(i==2)//学生系统
		{
			system("cls");
			printf("**********************************************************************\n");
			printf("******************************学生系统********************************\n\n");
			for_student();
		}
		else if(i==1)//管理员系统
		{
			printf("请输入密码（我的学号，屏幕上有）：");
			j=0;
			while((password[j]=getch())!='\r')
			{
				printf("*");
				j++;
			}
			printf("\n");
			password[j]='\0';
			if(strcmp(password,"11823020220")!=0)//密码错误可重新输入
			{
				printf("密码错误！");
				Sleep(500);
				system("cls");
				printf("*************************************************************************\n");
				printf("**************************学分信息管理***********************************\n");
				printf("                                                       ——11823020220王游\n");
				printf("           1.管理员系统    2.学生系统     3.退出系统\n");
				printf("请进入正确的系统：");
			}
			else//进入系统
			{
				system("cls");
				printf("*****************************************************************\n");
				printf("****************************管理员系统***************************\n\n");
				printf("    1.添加学生信息        2.查询学生信息        3.修改学生信息\n");
				printf("    4.删除学生信息        5.统计学生信息        6.重置密码\n");
				printf("    7.浏览全部信息        8.退出\n");
				printf("请输入相应的序号：");
				scanf("%d",&j);
				getchar();
				while(j!=8)//根据序号引用不同函数
				{
					if(j==1)
						add_information();
					if(j==2)
					{
						system("cls");
						printf("***************************************************************************\n");
						printf("**********************************查询系统*********************************\n\n");
						printf("  1.查询某学生信息       2.查询某班级信息          3.查询某课程未达毕业名单\n");
						printf("  4.查询某班未及格名单   5.查询未达毕业要求名单    6.退出\n");
						printf("请输入相应序号：");
						scanf("%d",&k);
						getchar();
						while(k!=6)//二级菜单，查询的多个功能
						{
							if(k==1)
								find_one_student();
							if(k==2)
								find_class_student();
							if(k==3)
								find_not_pass_kind();
							if(k==4)
								find_class_notpass_student();
							if(k==5)
								all_not_pass_student();
							printf("查看完毕按任意键退出");
							getch();
							system("cls");
							printf("***************************************************************************\n");
							printf("**********************************查询系统*********************************\n\n");
							printf("  1.查询某学生信息       2.查询某班级信息          3.查询某课程未达毕业名单\n");
							printf("  4.查询某班未及格名单   5.查询未达毕业要求名单    6.退出\n");
							printf("请输入相应序号：");
							scanf("%d",&k);
							getchar();
						}
					}
					if(j==3)
						modification_stu_inf();
					if(j==4)
						del_inf();
					if(j==5)
					{
						system("cls");
						printf("****************************************************************************\n");
						printf("*********************************统计信息***********************************\n\n");
						printf("1.查看某学生的总学分   2.查看各班的毕业情况  3.查看某类课的未达毕业要求名单\n");
						printf("请输入序号（4退出）：");
						scanf("%d",&k);
						getchar();
						while(k!=4)//统计信息的多个功能
						{
							if(k==1)
								look_one_score();
							if(k==2)
								look_number_for_pass();
							if(k==3)
								class_score();
							printf("查看完毕按任意键退出");
							getch();
							system("cls");
							printf("****************************************************************************\n");
							printf("*********************************统计信息***********************************\n\n");
							printf("1.查看某学生的总学分   2.查看各班的毕业情况  3.查看某类课的未达毕业要求名单\n");
							printf("请输入序号（4退出）：");
							scanf("%d",&k);
							getchar();
						}
					}
					if(j==6)
						re_password();
					if(j==7)
						view_all_inf();
					printf("查看完毕按任意键退出");
					getch();
					system("cls");//重载界面
					printf("*****************************************************************\n");
					printf("****************************管理员系统***************************\n\n");
					printf("    1.添加学生信息        2.查询学生信息        3.修改学生信息\n");
					printf("    4.删除学生信息        5.统计学生信息        6.重置密码\n");
					printf("    7.浏览全部信息        8.退出\n");
					printf("请输入相应的序号：");
					scanf("%d",&j);
					getchar();
				}
			}
		}
		system("cls");//重载界面
		printf("*************************************************************************\n");
		printf("**************************学分信息管理***********************************\n");
		printf("                                                       ——11823020220王游\n");
		printf("           1.管理员系统    2.学生系统     3.退出系统\n");
		printf("请进入正确的系统：");
		scanf("%d",&i);
		getchar();
	}
	return 0;
}